# a = [{:type1 => "母婴孕育-备孕妈妈",:id => 1914},
# {:type1 => "母婴孕育-怀孕妈妈",:id => 1915},
# {:type1 => "母婴孕育-新手妈妈",:id => 1948},
# {:type1 => "母婴孕育-早教幼教",:id => 1988},
# {:type1 => "母婴孕育-二胎时代",:id => 2190},
# {:type1 => "生活休闲-宝宝秀场",:id => 1917},
# {:type1 => "生活休闲-健康辣妈",:id => 2130},
# {:type1 => "生活休闲-家庭游记",:id => 1828},
# {:type1 => "生活休闲-晒货殿堂",:id => 1799},
# {:type1 => "生活休闲-美食分享",:id => 1820},
# {:type1 => "生活休闲-生活百科",:id => 2140},
# {:type1 => "生活休闲-女人心情",:id => 1771},
# {:type1 => "生活休闲-免费试用",:id => 1929},
# {:type1 => "生活休闲-谈天说地",:id => 1776},
# {:type1 => "生活休闲-数码家庭",:id => 2200},
# {:type1 => "版务论坛-版务专区",:id => 1782},]

# a.each do |js|
# 	p js[:id]
# end

a = [{:type1 => "母婴孕育-备孕妈妈",:id => 1914,:page => 170},
{:type1 => "母婴孕育-怀孕妈妈",:id => 1915,:page => 310},
{:type1 => "母婴孕育-新手妈妈",:id => 1948,:page => 750},
{:type1 => "母婴孕育-早教幼教",:id => 1988,:page => 500},
{:type1 => "母婴孕育-二胎时代",:id => 2190,:page => 64},
{:type1 => "生活休闲-宝宝秀场",:id => 1917,:page => 168},
{:type1 => "生活休闲-健康辣妈",:id => 2130,:page => 175},
{:type1 => "生活休闲-家庭游记",:id => 1828,:page => 51},
{:type1 => "生活休闲-晒货殿堂",:id => 1799,:page => 139},
{:type1 => "生活休闲-美食分享",:id => 1820,:page => 120},
{:type1 => "生活休闲-生活百科",:id => 2140,:page => 76},
{:type1 => "生活休闲-女人心情",:id => 1771,:page => 169},
{:type1 => "生活休闲-免费试用",:id => 1929,:page => 123},
{:type1 => "生活休闲-谈天说地",:id => 1776,:page => 337},
{:type1 => "生活休闲-数码家庭",:id => 2200,:page => 25},
{:type1 => "版务论坛-版务专区",:id => 1782,:page => 30}]

a.each do |a|
	p a[:type1]
	p a[:id]
	p a[:page]
end